#+TITLE: Optimizing RFR Models based on Perovskite Compositions
#+AUTHOR: Panayotis Manganaris
#+EMAIL: pmangana@purdue.edu
#+PROPERTY: header-args :session aikit :kernel mrg :async yes :pandoc org
** Compute Compostion Vectors using cmcl
additionally, cmcl offers a convenience function for creating groups
out of the column labels
#+begin_src jupyter-python :exports results :results raw drawer
  mc = mannodi.ft.comp() # compute numerical compostion vectors from strings
  mc = mc.collect.abx() # convenient site groupings for perovskites data
#+end_src

#+RESULTS:
:results:
:end:

** generate mix category and assign to index for future imaging
this helps with visualizing the final model performance by tracking
the features through all the model development transformations
#+begin_src jupyter-python :exports results :results raw drawer
  mixlog = mc.groupby(level=0, axis=1).count()
  mix = mixlog.pipe(Categories.logif, condition=lambda x: x>1, default="pure", catstring="and")
  mc = mc.assign(mix=mix).set_index("mix", append=True)
  my = my.assign(mix=mix).set_index("mix", append=True)
#+end_src

#+RESULTS:
:results:
:end:

